IDEA Open Model
Beam.Edges Property
Compatible with IDEA StatiCa Beta 20.0
 Lines of Element2D including edges, which are created by opening
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public List<ReferenceElement> Edges { get; set; }
Public Property Edges As List(Of ReferenceElement)
	Get
	Set
Property Value
Type: List<ReferenceElement>
Implements
IGeometryPart.Edges
See Also
Reference
Beam Class
IdeaRS.OpenModel.Detail Namespace